<?php

namespace App\Http\Controllers\Pdf;

use App\Http\Controllers\Controller;
use Illuminate\Http\Request;
use PDF;

class MarathiController extends Controller
{
    public function generate_pdf()
	{
		$data = [
			'foo' => 'bar'
		];
        $mpdf = new \Mpdf\Mpdf([
            'default_font_size' => 12,
            'default_font' => 'azx-marathi',
        ]);
        $mpdf->WriteHTML($this->PdfHTML());
        $mpdf->Output();
	}

    public function PdfHTML()
    {
        $output = "लॉकडाऊन नको, असा सल्ला दिला आहे. त्यांच्या या घोषणेनंतर आता महाराष्ट्रात लॉकडाऊन बाबत राज्यसरकार आपला निर्णय रद्द करणार की  कायम ठेवणार याकडे लक्ष लागले.

        राज्यात करोनाची वाढती संख्या कमी होत नाहीये. या सर्व गोष्टी पाहता राज्य सरकारने उद्यापासून कडक लॉकडाऊन लागू होणार याबाबतची घोषणा केली आहे. याबाबत मंत्रिमंडळ बैठकीत निर्णय घेतला. बुधवारी मुख्यमंत्री उद्धव ठाकरे याबाबत निर्णय घेणार असल्याचे देखील जाहीर करण्यात आले. ही घोषणा होते न होते तोच पंतप्रधान नरेंद्र मोदी यांनी जनतेला संबोधित केलं आहे.
        
        कोविद के मुद्दे पर राष्ट्र को संबोधित करते हुए, प्रधान मंत्री नरेंद्र मोदी ने कहा कि हमें सबसे कठिन समय में भी साहसी रहना चाहिए। हमें किसी भी स्थिति से निपटने के लिए सही निर्णय लेना चाहिए और सही दिशा में काम करना चाहिए ताकि हम जीत सकें। इस मंत्र को ध्यान में रखते हुए, आज देश दिन-रात काम कर रहा है।
        ";
        return $output;
    }
}